latex/structure/lists.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>lists</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
</head>
<body>
<div id="content">
<h1 class="title">lists</h1>
<p>
Numbered
</p>
<div class="org-src-container">

<pre class="src src-tex"><span style="color: #a020f0;">\begin</span>{<span style="color: #0000ff;">enumerate</span>}

<span style="color: #a020f0;">\item</span> Complex tasks are often best solved by linking together several
  existing programs rather than be re-inventing every possible
  low-level detail of the wheel over again;

<span style="color: #a020f0;">\item</span> Regular expressions, seen in the Part Ia course as a
  mathematical abstraction of the patterns that finite-state machines
  can process, generalise to provide amazingly powerful and flexible
  (if sometimes obscure-looking) capabilities;

<span style="color: #a020f0;">\end</span>{<span style="color: #0000ff;">enumerate</span>}
</pre>
</div>

<p>
<a href="../latex.html">back</a>
</p>
</div>
<div id="postamble" class="status">
<p class="validation"></p>
</div>
</body>
</html>
